In [67]:
import pandas as pd
student = [{'name' :  'A', 'birth' : '1999-06-27', 'mid':95, 'fin': 85},
           {'name' :  'B', 'birth' : '1997-06-27', 'mid':85, 'fin': 80},
           {'name' :  'C', 'birth' : '1998-06-27', 'mid':10, 'fin': 30},
           {'name' :  'D', 'birth' : '2000-06-27', 'mid':73, 'fin': 90}]

In [68]:
df = pd.DataFrame(student, columns= ['name', 'birth', 'mid', 'fin'])

In [69]:
df

  name       birth  mid  fin
0    A  1999-06-27   95   85
1    B  1997-06-27   85   80
2    C  1998-06-27   10   30
3    D  2000-06-27   73   90

In [70]:
def tot(vec):
    return vec['mid']+vec['fin']
def avg(vec):
    return tot(vec)/2

# 1. 기존 두 칼럼을 이용해 tot 칼럼 생성

In [71]:
df['tot'] = df.apply(tot, axis = 1)

# 2. 기존 두 칼럼 이용해 age 칼럼 생성

In [72]:
df['avg'] = df.apply(avg, axis = 1)

In [73]:
df

  name       birth  mid  fin  tot   avg
0    A  1999-06-27   95   85  180  90.0
1    B  1997-06-27   85   80  165  82.5
2    C  1998-06-27   10   30   40  20.0
3    D  2000-06-27   73   90  163  81.5

# 3. grade 칼럼 생성

In [74]:
def grade(vec):
    if avg(vec) >=90:
        return 'A'
    elif avg(vec) >=80:
        return 'B'
    elif avg(vec) >= 70:
        return 'C'
    else:
        return 'F'

In [75]:
df['grade'] = df.apply(grade, axis = 1)
df

  name       birth  mid  fin  tot   avg grade
0    A  1999-06-27   95   85  180  90.0     A
1    B  1997-06-27   85   80  165  82.5     B
2    C  1998-06-27   10   30   40  20.0     F
3    D  2000-06-27   73   90  163  81.5     B

# 4. 합격 불합격 칼럼 넣기

In [76]:
def grade1(vec):
    if grade(vec) in ['A','B', 'C']:
        return '합격'
    else: return '불합격'

In [77]:
df['grade1'] = df.apply(grade1, axis = 1)
df

  name       birth  mid  fin  tot   avg grade grade1
0    A  1999-06-27   95   85  180  90.0     A     합격
1    B  1997-06-27   85   80  165  82.5     B     합격
2    C  1998-06-27   10   30   40  20.0     F    불합격
3    D  2000-06-27   73   90  163  81.5     B     합격

# 5. 출생 년도만 가져오기

In [78]:
def year(vec):
    return vec['birth'][0:4]

In [79]:
df['year'] = df.apply(year, axis = 1)
df

  name       birth  mid  fin  tot   avg grade grade1  year
0    A  1999-06-27   95   85  180  90.0     A     합격  1999
1    B  1997-06-27   85   80  165  82.5     B     합격  1997
2    C  1998-06-27   10   30   40  20.0     F    불합격  1998
3    D  2000-06-27   73   90  163  81.5     B     합격  2000

# 6. 나이 계산하기

In [80]:
def age(vec):
    return 2020 - int(year(vec))+1

In [81]:
df['age'] = df.apply(age, axis = 1)
df

  name       birth  mid  fin  tot   avg grade grade1  year  age
0    A  1999-06-27   95   85  180  90.0     A     합격  1999   22
1    B  1997-06-27   85   80  165  82.5     B     합격  1997   24
2    C  1998-06-27   10   30   40  20.0     F    불합격  1998   23
3    D  2000-06-27   73   90  163  81.5     B     합격  2000   21

# 7. 나이가 23이상인 사람만 출력하기

In [85]:
df[df['age']>=23]

  name       birth  mid  fin  tot   avg grade grade1  year  age
1    B  1997-06-27   85   80  165  82.5     B     합격  1997   24
2    C  1998-06-27   10   30   40  20.0     F    불합격  1998   23

# 8. 나이가 22세 이상이고, 이름이 'A' 인 사람만 출력해 보세요

In [128]:
df[(df['age'] >= 22) & (df['name'] == 'A')]
# 조건이 2개 이상일때, & 연산자(and), or 연산자로 엮어주면 된다.

  name       birth  mid  fin  tot   avg grade grade1  year  age
0    A  1999-06-27   95   85  180  90.0     A     합격  1999   22

# 9. birth~grade 열까지 출력해보세요

In [111]:
df.loc[:, 'birth':'grade']

        birth  mid  fin  tot   avg grade
0  1999-06-27   95   85  180  90.0     A
1  1997-06-27   85   80  165  82.5     B
2  1998-06-27   10   30   40  20.0     F
3  2000-06-27   73   90  163  81.5     B

# 10. name, grade 열 추출

In [97]:
df[['name', 'grade']]

  name grade
0    A     A
1    B     B
2    C     F
3    D     B

# 11. 칼럼에 'i'를 포함한 칼럼만 출력해보세요

In [129]:
df.filter(like = 'i', axis = 1)
#칼럼 중, i를 포함한 것 출력 (조건 axis = 1)
# filter

        birth  mid  fin
0  1999-06-27   95   85
1  1997-06-27   85   80
2  1998-06-27   10   30
3  2000-06-27   73   90

In [127]:
col_name =[]
for i in df.columns:
    if 'i' in i:
        col_name.append(i)
df[col_name]

        birth  mid  fin
0  1999-06-27   95   85
1  1997-06-27   85   80
2  1998-06-27   10   30
3  2000-06-27   73   90